app/Models/M_contact.php

    function getAll()
    {
        $builder = $this->db->table('contacts');
        // $builder->join('groups', 'groups.id_group = contacts.id_contact'); //meangurutkan berdasarkan dari id_contact
        $builder->join('groups', 'groups.id_group = contacts.id_group'); //meangurutkan berdasarkan dari id_group
        $query = $builder->get();
---
SELECT *
FROM `contacts`
JOIN `groups` ON `groups`.`id_group` = `contacts`.`id_group`